"""Эта программа "гадает" по книге

Вам нужно заполнить функции своим кодом в соответствии с вашим вариантом,
дописывайте нужные функции по необходимости.
"""


def read_book(filename):
    """Эта функция должна возвращать текст книги
    
    filename : str
        Строка с путём до книги


    Возвращает строку с текстом книги
    """
    return text


def listen_question():
    """Эта функция должна попросить пользователя задать вопрос и вернуть ответ

    Если введённое не заканчивается на знак вопроса, нужно переспросить

    Возвращает строку с введённым вопросом
    """
    return question


def answer(text, question):
    """Отвечает на вопрос, используя книгу
    
    text : str
        Текст книги
    question : str
        Строка с вопросом

    Возвращает строку с найденным ответом
    """
    return answer


def print_answer(answer):
    """Печатает ответ, обрамляя его красивой фразой
    
    Эта функция ничего не возвращает
    """


def main():
    """С этой функции начинается выполнение программы"""


if __name__ == '__main__':
    main()
